In [4]:
# Dependencies and Setup
import pandas as pd
import numpy as np

# File to Load (Remember to Change These)
school_data_to_load = "Resources/schools_complete.csv"
student_data_to_load = "Resources/students_complete.csv"

# Read School and Student Data File and store into Pandas Data Frames
school_data = pd.read_csv(school_data_to_load)
student_data = pd.read_csv(student_data_to_load)

# Combine the data into a single dataset
school_data_complete = pd.merge(student_data, school_data, how="left", on=["school_name", "school_name"])

# show start of df
school_data_complete.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [5]:
# show end of df
school_data_complete.tail()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
39165,39165,Donna Howard,F,12th,Thomas High School,99,90,14,Charter,1635,1043130
39166,39166,Dawn Bell,F,10th,Thomas High School,95,70,14,Charter,1635,1043130
39167,39167,Rebecca Tanner,F,9th,Thomas High School,73,84,14,Charter,1635,1043130
39168,39168,Desiree Kidd,F,10th,Thomas High School,99,90,14,Charter,1635,1043130
39169,39169,Carolyn Jackson,F,11th,Thomas High School,95,75,14,Charter,1635,1043130

In [6]:
school_data_complete.describe

<bound method NDFrame.describe of        Student ID       student_name gender grade         school_name  \
0               0       Paul Bradley      M   9th   Huang High School
1               1       Victor Smith      M  12th   Huang High School
2               2    Kevin Rodriguez      M  12th   Huang High School
3               3  Dr. Richard Scott      M  12th   Huang High School
4               4         Bonnie Ray      F   9th   Huang High School
...           ...                ...    ...   ...                 ...
39165       39165       Donna Howard      F  12th  Thomas High School
39166       39166          Dawn Bell      F  10th  Thomas High School
39167       39167     Rebecca Tanner      F   9th  Thomas High School
39168       39168       Desiree Kidd      F  10th  Thomas High School
39169       39169    Carolyn Jackson      F  11th  Thomas High School

       reading_score  math_score  School ID      type  size   budget
0                 66          79          0  District  2917  1910635
1                 94          61          0  District  2917  1910635
2                 90          60          0  District  2917  1910635
3                 67          58          0  District  2917  1910635
4                 97          84          0  District  2917  1910635
...              ...         ...        ...       ...   ...      ...
39165             99          90         14   Charter  1635  1043130
39166             95          70         14   Charter  1635  1043130
39167             73          84         14   Charter  1635  1043130
39168             99          90         14   Charter  1635  1043130
39169             95          75         14   Charter  1635  1043130

[39170 rows x 11 columns]>

In [7]:
# check for incomplete columns
count = school_data_complete.count()
count

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
School ID        39170
type             39170
size             39170
budget           39170
dtype: int64

In [8]:
# find count of schools
total_schools = len(school_data_complete["school_name"].unique())
total_schools

15

In [9]:
# find total count of students

total_students = school_data_complete["Student ID"].count()
total_students

39170

In [10]:
# find district budget
total_school_budget = sum(school_data_complete["budget"].unique())
total_school_budget

24649428

In [11]:
# find district average math score
average_math_score = '{:,.2f}'.format(school_data_complete["math_score"].mean())
average_math_score

'78.99'

In [12]:
# find district average reading score
average_reading_score = '{:,.2f}'.format(school_data_complete["reading_score"].mean())
average_reading_score

'81.88'

In [13]:
# find disrtict passing math percentage
passing_math = "{0:.2%}".format((len(school_data_complete[school_data_complete["math_score"] > 59]))/total_students)
passing_math

'92.45%'

In [14]:
# find district passing reading percentage
passing_reading = "{0:.2%}".format((len(school_data_complete[school_data_complete["reading_score"] > 59]))/total_students)
passing_reading

'100.00%'

In [15]:
# find overall average of math and reading percentages
    # overall_passing_rate = int(passing_math) + 1 
    # overall_passing_rate

In [16]:
#school_group_dftest = school_data_complete.groupby(["school_name","type"])
#school_group_dftest.head()

In [17]:
#school_group_df = school_data_complete.loc[school_data_complete["school_name"] == "Huang High School", :]
#school_group_df

In [42]:
# create and clean new summary datafram
school_data_summary = school_data.copy()
school_data_summary.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [43]:
school_data_summary = school_data_summary.drop(columns={"School ID"})
school_data_summary.head()

             school_name      type  size   budget
0      Huang High School  District  2917  1910635
1   Figueroa High School  District  2949  1884411
2    Shelton High School   Charter  1761  1056600
3  Hernandez High School  District  4635  3022020
4    Griffin High School   Charter  1468   917500

In [44]:
school_data_summary = school_data_summary.rename(columns={"school_name":"School Name", "type":"Type", "size":"Size", "budget":"Budget"})
school_data_summary.head()

             School Name      Type  Size   Budget
0      Huang High School  District  2917  1910635
1   Figueroa High School  District  2949  1884411
2    Shelton High School   Charter  1761  1056600
3  Hernandez High School  District  4635  3022020
4    Griffin High School   Charter  1468   917500

In [45]:
school_data_summary['Per Student Budget'] = ''
school_data_summary['Average Math Score'] = ''
school_data_summary['Average Reading Score'] = ''
school_data_summary['Passing Math'] = ''
school_data_summary['Passing Reading'] = ''
school_data_summary['Overall Passing Rate'] = ''
school_data_summary.head()

,School Name,Type,Size,Budget,Per Student Budget,Average Math Score,Average Reading Score,Passing Math,Passing Reading,Overall Passing Rate
0,Huang High School,District,2917,1910635,,,,,,
1,Figueroa High School,District,2949,1884411,,,,,,
2,Shelton High School,Charter,1761,1056600,,,,,,
3,Hernandez High School,District,4635,3022020,,,,,,
4,Griffin High School,Charter,1468,917500,,,,,,

In [52]:
school_data_summary["Per Student Budget"] = school_data_summary["Budget"] / school_data_summary["Size"]
school_data_summary["Per Student Budget"] = school_data_summary["Per Student Budget"].map("${:,.2f}".format)
school_data_summary.head()

,School Name,Type,Size,Budget,Per Student Budget,Average Math Score,Average Reading Score,Passing Math,Passing Reading,Overall Passing Rate
0,Huang High School,District,2917,1910635,$655.00,,,,,
1,Figueroa High School,District,2949,1884411,$639.00,,,,,
2,Shelton High School,Charter,1761,1056600,$600.00,,,,,
3,Hernandez High School,District,4635,3022020,$652.00,,,,,
4,Griffin High School,Charter,1468,917500,$625.00,,,,,